tamarintech/MarlinDev/boards.txt
SAVMkI.build.mcu=at90usb1286
SAVMkI.build.f_cpu=16000000L
SAVMkI.build.board=AVR_SAVMkI
SAVMkI.build.core=at90usb
SAVMkI.build.dependency=true
SAVMkI.build.variant=at90usb
SAVMkI.build.vid=0x16D0
SAVMkI.build.pid=0x076B
SAVMkI.build.extra_flags=-DUSB_VID={build.vid} -DUSB_PID={build.pid}

########################################
## SAVMkI (HID)
########################################
SAVMkI_HID.name=SAV MkI (HID Bootloader)

SAVMkI_HID.bootloader.tool=avrdude
SAVMkI_HID.bootloader.low_fuses=0xDE
SAVMkI_HID.bootloader.high_fuses=0xDB
SAVMkI_HID.bootloader.extended_fuses=0xF1
SAVMkI_HID.bootloader.unlock_bits=0x3F
SAVMkI_HID.bootloader.lock_bits=0x02F
SAVMkI_HID.bootloader.file=SAVMkI/SAVMkI_HID.hex

SAVMkI_HID.upload.tool=hidloader
SAVMkI_HID.upload.protocol=halfkay
SAVMkI_HID.upload.maximum_size=126976
SAVMkI_HID.upload.maximum_ram_size=8192
SAVMkI_HID.upload.speed=115200
SAVMkI_HID.upload.disable_flushing=true

SAVMkI_HID.build.mcu=at90usb1286
SAVMkI_HID.build.f_cpu=16000000L
SAVMkI_HID.build.board=AVR_SAVMkI
SAVMkI_HID.build.core=at90usb
SAVMkI_HID.build.dependency=true
SAVMkI_HID.build.variant=at90usb
SAVMkI_HID.build.vid=0x16D0
SAVMkI_HID.build.pid=0x076B
SAVMkI_HID.build.extra_flags=-DUSB_VID={build.vid} -DUSB_PID={build.pid}


########################################
## Sanguino
########################################
sanguino.name=Sanguino

sanguino.upload.tool=avrdude
### Verify the rest of these
sanguino.upload.protocol=stk500
sanguino.upload.maximum_size=131072
sanguino.upload.speed=57600

sanguino.bootloader.tool=avrdude
sanguino.bootloader.low_fuses=0xD6
sanguino.bootloader.high_fuses=0xDA
sanguino.bootloader.extended_fuses=0xFD
sanguino.bootloader.unlock_bits=0x3F
sanguino.bootloader.lock_bits=0x0F

sanguino.build.mcu=atmega1284p
sanguino.build.f_cpu=16000000L
sanguino.build.board=AVR_SANGUINO
sanguino.build.core=arduino
sanguino.build.variant=sanguino

sanguino.menu.cpu.atmega644=ATmega644P
sanguino.menu.cpu.atmega644.upload.maximum_size=63488
sanguino.menu.cpu.atmega644.bootloader.low_fuses=0xFF
sanguino.menu.cpu.atmega644.bootloader.high_fuses=0x9A
sanguino.menu.cpu.atmega644.bootloader.extended_fuses=0xFF
sanguino.menu.cpu.atmega644.bootloader.file=ATmegaBOOT_168_atmega644p.hex
sanguino.menu.cpu.atmega644.build.mcu=atmega644p

sanguino.menu.cpu.atmega12848m=ATmega1284p 8MHz
sanguino.menu.cpu.atmega12848m.upload.speed=19200
sanguino.menu.cpu.atmega12848m.bootloader.file=ATmegaBOOT_168_atmega1284p_8m.hex
sanguino.menu.cpu.atmega12848m.build.f_cpu=8000000L

sanguino.menu.cpu.atmega1284=ATmega1284p 16MHz
sanguino.menu.cpu.atmega1284.bootloader.file=ATmegaBOOT_168_atmega1284p.hex

sanguino.menu.cpu.atmega1284m=ATmega1284p 20MHz
sanguino.menu.cpu.atmega1284m.bootloader.file=ATmegaBOOT_168_atmega1284p.hex
sanguino.menu.cpu.atmega1284m.build.f_cpu=20000000L


### The mega had this, do we need it?
### sanguino.upload.maximum_data_size=8192

### Revise these if they don't make sense for the sanguino
sanguino.menu.marlin.travis01.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/RAMPS_13_EFB_default.h
sanguino.menu.marlin.travis01=Default Configuration
sanguino.menu.marlin.travis02.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/TEMP_SENSOR_BED.h
sanguino.menu.marlin.travis02=Bed Sensor
sanguino.menu.marlin.travis03.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/dual_extruder.h
sanguino.menu.marlin.travis03=2 Extruders
sanguino.menu.marlin.travis04.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/triple_extruder.h
sanguino.menu.marlin.travis04=3 Extruders
sanguino.menu.marlin.travis05.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/PIDTEMPBED.h
sanguino.menu.marlin.travis05=Bed PID
sanguino.menu.marlin.travis06.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/AUTO_BED_LEVELING_FEATURE.h
sanguino.menu.marlin.travis06=Bed Leveling
sanguino.menu.marlin.travis07.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/SERVOS.h
sanguino.menu.marlin.travis07=Bed Leveling with servos
sanguino.menu.marlin.travis08.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/EEPROM.h
sanguino.menu.marlin.travis08=EEPROM Config Store
sanguino.menu.marlin.travis09.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/ULTIMAKERCONTROLLER.h
sanguino.menu.marlin.travis09=Ultimaker Controller
sanguino.menu.marlin.travis11.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/REPRAP_DISCOUNT_SMART_CONTROLLER.h
sanguino.menu.marlin.travis11=Reprap Discount Controller
sanguino.menu.marlin.travis12.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/G3D_PANEL.h
sanguino.menu.marlin.travis12=G3D_PANE
sanguino.menu.marlin.travis13.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/REPRAP_DISCOUNT_FULL_GRAPHIC_SMART_CONTROLLER.h
sanguino.menu.marlin.travis13=Reprap Full Graphic
sanguino.menu.marlin.travis15.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/RA_CONTROL_PANEL.h
sanguino.menu.marlin.travis15=RA Control Panel
sanguino.menu.marlin.travis17.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/LCD_I2C_PANELOLU2.h
sanguino.menu.marlin.travis17=OLU2 Control Panel
sanguino.menu.marlin.travis18.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/LCD_I2C_VIKI.h
sanguino.menu.marlin.travis18=VIKI Display
sanguino.menu.marlin.travis19.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/FILAMENT_SENSOR.h
sanguino.menu.marlin.travis19=Filament Sensor
sanguino.menu.marlin.travis20.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/FILAMENT_LCD_DISPLAY.h
sanguino.menu.marlin.travis20=Filament Sensor w/ display
sanguino.menu.marlin.travis21.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/COREXY.h
sanguino.menu.marlin.travis21=CORE XY
sanguino.menu.marlin.travis22.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/COREXZ.h
sanguino.menu.marlin.travis22=CORE XZ
sanguino.menu.marlin.travis23.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/Z_DUAL_ENDSTOPS.h
sanguino.menu.marlin.travis23=Dual Z
sanguino.menu.marlin.travis24.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/deprecated_configurations/delta/generic/Configuration.h
sanguino.menu.marlin.travis24=DELTA
sanguino.menu.marlin.travis25.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/deprecated_configurations/delta/kossel_mini/Configuration.h
sanguino.menu.marlin.travis25=Mini Kossel
sanguino.menu.marlin.travis26.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/deprecated_configurations/SCARA/Configuration.h
sanguino.menu.marlin.travis26=SCARA

########################################
## RAMBo
########################################
rambo.name=RAMBo
rambo.vid.0=0x27b1
rambo.pid.0=0x0001

rambo.upload.tool=arduino:avrdude
rambo.upload.protocol=wiring
rambo.upload.maximum_size=258048
rambo.upload.speed=115200

rambo.bootloader.tool=avrdude
rambo.bootloader.low_fuses=0xFF
rambo.bootloader.high_fuses=0xD8
rambo.bootloader.extended_fuses=0xFD
rambo.bootloader.unlock_bits=0x3F
rambo.bootloader.lock_bits=0x0F
rambo.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex

rambo.build.mcu=atmega2560
rambo.build.f_cpu=16000000L
rambo.build.board=AVR_RAMBO
rambo.build.core=arduino
rambo.build.variant=rambo


### The mega had this, do we need it?
### rambo.upload.maximum_data_size=8192

### Revise these if they don't make sense for the rambo
rambo.menu.marlin.default.build.unique_id_flags=
rambo.menu.marlin.default=Default Configuration
rambo.menu.marlin.travis01.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/RAMPS_13_EFB_default.h
rambo.menu.marlin.travis01=Simple Ramps 1.3
rambo.menu.marlin.travis02.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/TEMP_SENSOR_BED.h
rambo.menu.marlin.travis02=Bed Sensor
rambo.menu.marlin.travis03.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/dual_extruder.h
rambo.menu.marlin.travis03=2 Extruders
rambo.menu.marlin.travis04.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/triple_extruder.h
rambo.menu.marlin.travis04=3 Extruders
rambo.menu.marlin.travis05.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/PIDTEMPBED.h
rambo.menu.marlin.travis05=Bed PID
rambo.menu.marlin.travis06.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/AUTO_BED_LEVELING_FEATURE.h
rambo.menu.marlin.travis06=Bed Leveling
rambo.menu.marlin.travis07.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/SERVOS.h
rambo.menu.marlin.travis07=Bed Leveling with servos
rambo.menu.marlin.travis08.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/EEPROM.h
rambo.menu.marlin.travis08=EEPROM Config Store
rambo.menu.marlin.travis09.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/ULTIMAKERCONTROLLER.h
rambo.menu.marlin.travis09=Ultimaker Controller
rambo.menu.marlin.travis11.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/REPRAP_DISCOUNT_SMART_CONTROLLER.h
rambo.menu.marlin.travis11=Reprap Discount Controller
rambo.menu.marlin.travis12.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/G3D_PANEL.h
rambo.menu.marlin.travis12=G3D_PANE
rambo.menu.marlin.travis13.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/REPRAP_DISCOUNT_FULL_GRAPHIC_SMART_CONTROLLER.h
rambo.menu.marlin.travis13=Reprap Full Graphic
rambo.menu.marlin.travis15.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/RA_CONTROL_PANEL.h
rambo.menu.marlin.travis15=RA Control Panel
rambo.menu.marlin.travis17.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/LCD_I2C_PANELOLU2.h
rambo.menu.marlin.travis17=OLU2 Control Panel
rambo.menu.marlin.travis18.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/LCD_I2C_VIKI.h
rambo.menu.marlin.travis18=VIKI Display
rambo.menu.marlin.travis19.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/FILAMENT_SENSOR.h
rambo.menu.marlin.travis19=Filament Sensor
rambo.menu.marlin.travis20.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/FILAMENT_LCD_DISPLAY.h
rambo.menu.marlin.travis20=Filament Sensor w/ display
rambo.menu.marlin.travis21.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/COREXY.h
rambo.menu.marlin.travis21=CORE XY
rambo.menu.marlin.travis22.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/COREXZ.h
rambo.menu.marlin.travis22=CORE XZ
rambo.menu.marlin.travis23.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/travis/Z_DUAL_ENDSTOPS.h
rambo.menu.marlin.travis23=Dual Z
rambo.menu.marlin.travis24.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/deprecated_configurations/delta/generic/Configuration.h
rambo.menu.marlin.travis24=DELTA
rambo.menu.marlin.travis25.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/deprecated_configurations/delta/kossel_mini/Configuration.h
rambo.menu.marlin.travis25=Mini Kossel
rambo.menu.marlin.travis26.build.unique_id_flags=-DCONFIGURATION_FILE=configurations/deprecated_configurations/SCARA/Configuration.h
rambo.menu.marlin.travis26=SCARA
